#include "GraphicsPipeline.h"

//-----------------------------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------------------------
GraphicsPipeline::GraphicsPipeline()
{
}

//-----------------------------------------------------------------------------
// 描画
//-----------------------------------------------------------------------------
void GraphicsPipeline::Render()
{
	// 今のところこんな感じかな


	// カメラ情報をGPUに転送


	// ここで3D描画


	// ここでポストエフェクト描画


	// ここでEffect描画


	// ここでSprite描画
}
